load-tests/http-light-load.yml
config:
  # Configuração do target (servidor a ser testado)
  target: 'http://localhost:3000'
  
  # Fases do teste de carga
  phases:
    # Fase 1: Aquecimento - 10 usuários virtuais por segundo durante 30 segundos
    - duration: 30
      arrivalRate: 10
      name: "Aquecimento - Carga leve"
    
    # Fase 2: Carga constante - 20 usuários virtuais por segundo durante 60 segundos
    - duration: 60
      arrivalRate: 20
      name: "Carga constante"
    
    # Fase 3: Desaceleração - 10 usuários virtuais por segundo durante 30 segundos
    - duration: 30
      arrivalRate: 10
      name: "Desaceleração"
  
  # Processadores e plugins
  processor: "./load-tests/functions.js"
  
  # Variáveis de ambiente
  variables:
    testUser: "loadtest_user"
    testPassword: "Test123!@#"

scenarios:
  # Cenário 1: Testar endpoint de registro
  - name: "Registro de Usuário"
    weight: 30
    beforeRequest: "setVariables"
    flow:
      - post:
          url: "/api/auth/register"
          json:
            username: "{{ randomUsername }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
            - contentType: json

  # Cenário 2: Testar endpoint de login
  - name: "Login de Usuário"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ testUser }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 
                - 200
                - 401
            - contentType: json

  # Cenário 3: Obter ranking
  - name: "Consultar Ranking"
    weight: 30
    flow:
      - get:
          url: "/api/auth/ranking"
          expect:
            - statusCode: 200
            - contentType: json